{"modNames":["Mod","Mods"],
"helptext":"Hello! I'm ChimechoBot. I have the following commands:\n.createQ - Makes a Queue. Queues are owned by their creator and are on a per-channel basis.\n.ring - Opens a new Queue using your saved settings if available.\n.version - Check what version I'm currently running.\n.help - Displays this menu.",
"helptextown":"Hello! I'm ChimechoBot. I have the following commands available for Queue owners:\n.deleteQ - Deletes the Queue in its entirety and frees the channel for more Queues.\n.closeQ - Disallows more users from joining. Automatically deletes the Queue when the Queue is empty.\n.openQ - Reopens a Queue for further joins if used before the Queue is deleted.\n.viewQ - Sends you a list of who is in the queue.\n.next - Sends you and the next 3 people in the Queue (random) codes to connect with. Usable from DM after the first .next.\n.add - Sends the next in Queue the same code as the last group. Command usable from DM.\n.configureQ - Configures the Queue. Requires arguments. Use \".configureQ help\" for more information.\n.save - Saves your current configuration for use in future Queues.\n.up - Sends a messsage to the channel that the room is available to join. Only usable via DM.\n.boot <user> - Kicks the user from the Queue.\n.ban <user> - Kicks the given user and bans them from joining your Queues.\n.unban <user> - Unbans a user.\n.viewbans - Sends you a list of users you currently have banned.\n.help - Displays this menu.",
"helptextjoiner":"Hello! I'm ChimechoBot. I have the following commands:\n.join - Join the Queue if you aren't in the queue already.\n.leave - Leave the Queue.\n.numQ - Displays your position in the Queue. Useable from DM after first.\n.help - Displays this menu.",
"configurehelptext":".configureQ supports the following options:\ncurrent - Display the current configuration. Only shows non-default values.\nlobbysize <number> - Change the number of people per lobby.\nlobbies <number> - Set a max number of lobbies. Automatically closes queue when last lobby is filled and clears queue when last lobby is called via next.\nopenlobby - Removes the max lobby restriction set by lobbies.\nshowusers - Adds a list of who is joining a Queue to the code message.\nhideusers - Removes the list of who is joining a Queue from the code message.\nshowjoin - Users will recieve acknowledgement of joining by react.\nhidejoin - Users will recieve acknowledgement of joining by DM and the .join messages will be deleted.\nattempts <number> - Set a maximum number of joins per user\nopenattempt - Allow any number of joins per user\nhelp - Displays this menu.",
"modhelptext":".mod allows the following commands:\ndelete - Force closes the Queue.\nview - Sends you a list of who is currently in the queue.\nboot <user> - Kicks the user from the Queue.\nviewjoined - Sends you a list of all users that have been sent a code."
}
